Revit 2027 API
Material.GetIdentityParameterIds Method
 Gets material identity parameter ids from the material.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ElementId> GetIdentityParameterIds()
Public Shared Function GetIdentityParameterIds As IList(Of ElementId)
public:
static IList<ElementId^>^ GetIdentityParameterIds()
static member GetIdentityParameterIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace